# SetLightDirection

## Description
Procedure SetLightDirection sets the direction angles of the referenced light object.

```pascal
PROCEDURE SetLightDirection(
				h          : HANDLE;
				panAngleR  : REAL;
				tiltAngleR : REAL);
```

```python

def vs.SetLightDirection(h, panAngleR, tiltAngleR):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to light.|
|panAngleR|REAL|Pan angle of light.|
|tiltAngleR|REAL|Tilt angle of light.|

## Version
Availability: from MiniCAD7.0
## Category
* Objects - Lights